# i არის საიტერაციო ცვლადი და ის ყოველ იტერაციაზე ივლის მნიშვნელობას
# for loop-ში თითო იტერაციაზე i-ში შენახული მნიშვნელობა იცვლება
# for არის key word ამის მეშვეობით ჩვენ პითონს ვეუბნებით რომ უნდა შევქმნათ for loop
# in ის საშვალებით ჩვენ შეგვიძლია პროგრამას ვუთხრათ სად უნდა ეძებოს i-სთვის მნიშვნელობა
# range არის ფუნქცია რომლის მეშვეობით ვქმნით ციფრების მიმდევრობას
# : ანიშნებს პითონს for loop-ის წერა დამთავრდა და ინდენტაცია რომელ ხაზზეც იქნება დაცული for loop-ში იქნება და ამ შემთხვევაში გამეორდება 10-ჯერ 
# print(!) ტერმინალში გადმოიტანს i-ს რაც ინახება იქამდე სანამ for loop-ი იმუშავებს